{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.2,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "arts_culture",
    "1": "business",
    "2": "crime",
    "3": "entertainment",
    "4": "family_education",
    "5": "health_wellness",
    "6": "international",
    "7": "lifestyle",
    "8": "media",
    "9": "other",
    "10": "politics",
    "11": "sports",
    "12": "tech_science"
  },
  "initializer_range": 0.02,
  "label2id": {
    "arts_culture": 0,
    "business": 1,
    "crime": 2,
    "entertainment": 3,
    "family_education": 4,
    "health_wellness": 5,
    "international": 6,
    "lifestyle": 7,
    "media": 8,
    "other": 9,
    "politics": 10,
    "sports": 11,
    "tech_science": 12
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.12.1",
  "vocab_size": 30522
}
